[
    {
        "title":"คอมพิวเตอร์คืออะไร",
        "subtitle":"คืออุปกรณ์สำหรับคำนวณและทำงานอื่นๆ",
        "image_url":"https://cdn.pixabay.com/photo/2014/05/03/01/03/laptop-336704_960_720.jpg",
        "detail":"  คอมพิวเตอร์ คือ อุปกรณ์ทางอิเล็กทรอนิกส์ (electrinic device) ที่มนุษย์ใช้เป็นเครื่องมือช่วยในการจัดการกับข้อมูลที่อาจเป็นได้ ทั้งตัวเลข ตัวอักษร หรือสัญลักษณ์ที่ใช้แทนความหมายในสิ่งต่าง ๆ โดยคุณสมบัติที่สำคัญของคอมพิวเตอร์คือการที่สามารถกำหนดชุดคำสั่งล่วงหน้าหรือโปรแกรมได้ (programmable) นั่นคือคอมพิวเตอร์สามารถทำงานได้หลากหลายรูปแบบ ขึ้นอยู่กับชุดคำสั่งที่เลือกมาใช้งาน ทำให้สามารถนำคอมพิวเตอร์ไปประยุกต์ใช้งานได้อย่างกว้างขวาง เช่น ใช้ในการตรวจคลื่นความถี่ของหัวใจ การฝาก - ถอนเงินในธนาคาร การตรวจสอบสภาพเครื่องยนต์ เป็นต้น ข้อดีของคอมพิวเตอร์ คือ เครื่องคอมพิวเตอร์สามารถทำงานได้อย่างมีประสิทธภาพ มีความถูกต้อง และมีความรวดเร็ว\n\nอย่างไรก็ดี ไม่ว่าจะเป็นงานชนิดใดก็ตาม เครื่องคอมพิวเตอร์จะมีวงจรการทำงานพื้นฐาน 4 อย่าง (IPOS cycle) คือ\n\nรับข้อมูล (Input) เครื่องคอมพิวเตอร์จะทำการรับข้อมูลจากหน่วยรับข้อมูล (input unit) เช่น คีบอร์ด หรือ เมาส์\n\nประมวลผล (Processing) เครื่องคอมพิวเตอร์จะทำการประมวลผลกับข้อมูล เพื่อแปลงให้อยู่ในรูปอื่นตามที่ต้องการ\n\nแสดงผล (Output) เครื่องคอมพิวเตอร์จะให้ผลลัพธ์จากการประมวลผลออกมายังหน่วยแสดงผลลัพธ์ (output unit) เช่น เครื่องพิมพ์ หรือจอภาพ\n\nเก็บข้อมูล (Storage) เครื่องคอมพิวเตอร์จะทำการเก็บผลลัพธ์จากการประมวลผลไว้ในหน่วยเก็บข้อมูล เพื่อให้สามารถนำมาใช้ใหม่ได้ในอนาคต\n\n"
    },
    {       
        "title":"มาเขียนโปรแกรมกัน",
        "subtitle":"บทความนี้สอนการเขียนโปรแกรม",
        "image_url":"https://cdn.pixabay.com/photo/2017/05/11/11/15/workplace-2303851_960_720.jpg",
        "detail":"คอมพิวเตอร์proram คือ อุปกรณ์ทางอิเล็กทรอนิกส์ (electrinic device) ที่มนุษย์ใช้เป็นเครื่องมือช่วยในการจัดการกับข้อมูลที่อาจเป็นได้ ทั้งตัวเลข ตัวอักษร หรือสัญลักษณ์ที่ใช้แทนความหมายในสิ่งต่าง ๆ โดยคุณสมบัติที่สำคัญของคอมพิวเตอร์คือการที่สามารถกำหนดชุดคำสั่งล่วงหน้าหรือโปรแกรมได้ (programmable) นั่นคือคอมพิวเตอร์สามารถทำงานได้หลากหลายรูปแบบ ขึ้นอยู่กับชุดคำสั่งที่เลือกมาใช้งาน ทำให้สามารถนำคอมพิวเตอร์ไปประยุกต์ใช้งานได้อย่างกว้างขวาง เช่น ใช้ในการตรวจคลื่นความถี่ของหัวใจ การฝาก - ถอนเงินในธนาคาร การตรวจสอบสภาพเครื่องยนต์ เป็นต้น ข้อดีของคอมพิวเตอร์ คือ เครื่องคอมพิวเตอร์สามารถทำงานได้อย่างมีประสิทธภาพ มีความถูกต้อง และมีความรวดเร็ว\n\nอย่างไรก็ดี ไม่ว่าจะเป็นงานชนิดใดก็ตาม เครื่องคอมพิวเตอร์จะมีวงจรการทำงานพื้นฐาน 4 อย่าง (IPOS cycle) คือ\n\nรับข้อมูล (Input) เครื่องคอมพิวเตอร์จะทำการรับข้อมูลจากหน่วยรับข้อมูล (input unit) เช่น คีบอร์ด หรือ เมาส์\n\nประมวลผล (Processing) เครื่องคอมพิวเตอร์จะทำการประมวลผลกับข้อมูล เพื่อแปลงให้อยู่ในรูปอื่นตามที่ต้องการ\n\nแสดงผล (Output) เครื่องคอมพิวเตอร์จะให้ผลลัพธ์จากการประมวลผลออกมายังหน่วยแสดงผลลัพธ์ (output unit) เช่น เครื่องพิมพ์ หรือจอภาพ\n\nเก็บข้อมูล (Storage) เครื่องคอมพิวเตอร์จะทำการเก็บผลลัพธ์จากการประมวลผลไว้ในหน่วยเก็บข้อมูล เพื่อให้สามารถนำมาใช้ใหม่ได้ในอนาคต\n\n"
    },
    {
        "title":"Flutter คือ",
        "subtitle":"Tools สำหรับออกแบบ UI ของ Google",
        "image_url":"https://cdn.pixabay.com/photo/2014/05/02/21/47/laptop-336369_960_720.jpg",
        "detail":"flu6tter คือ อุปกรณ์ทางอิเล็กทรอนิกส์ (electrinic device) ที่มนุษย์ใช้เป็นเครื่องมือช่วยในการจัดการกับข้อมูลที่อาจเป็นได้ ทั้งตัวเลข ตัวอักษร หรือสัญลักษณ์ที่ใช้แทนความหมายในสิ่งต่าง ๆ โดยคุณสมบัติที่สำคัญของคอมพิวเตอร์คือการที่สามารถกำหนดชุดคำสั่งล่วงหน้าหรือโปรแกรมได้ (programmable) นั่นคือคอมพิวเตอร์สามารถทำงานได้หลากหลายรูปแบบ ขึ้นอยู่กับชุดคำสั่งที่เลือกมาใช้งาน ทำให้สามารถนำคอมพิวเตอร์ไปประยุกต์ใช้งานได้อย่างกว้างขวาง เช่น ใช้ในการตรวจคลื่นความถี่ของหัวใจ การฝาก - ถอนเงินในธนาคาร การตรวจสอบสภาพเครื่องยนต์ เป็นต้น ข้อดีของคอมพิวเตอร์ คือ เครื่องคอมพิวเตอร์สามารถทำงานได้อย่างมีประสิทธภาพ มีความถูกต้อง และมีความรวดเร็ว\n\nอย่างไรก็ดี ไม่ว่าจะเป็นงานชนิดใดก็ตาม เครื่องคอมพิวเตอร์จะมีวงจรการทำงานพื้นฐาน 4 อย่าง (IPOS cycle) คือ\n\nรับข้อมูล (Input) เครื่องคอมพิวเตอร์จะทำการรับข้อมูลจากหน่วยรับข้อมูล (input unit) เช่น คีบอร์ด หรือ เมาส์\n\nประมวลผล (Processing) เครื่องคอมพิวเตอร์จะทำการประมวลผลกับข้อมูล เพื่อแปลงให้อยู่ในรูปอื่นตามที่ต้องการ\n\nแสดงผล (Output) เครื่องคอมพิวเตอร์จะให้ผลลัพธ์จากการประมวลผลออกมายังหน่วยแสดงผลลัพธ์ (output unit) เช่น เครื่องพิมพ์ หรือจอภาพ\n\nเก็บข้อมูล (Storage) เครื่องคอมพิวเตอร์จะทำการเก็บผลลัพธ์จากการประมวลผลไว้ในหน่วยเก็บข้อมูล เพื่อให้สามารถนำมาใช้ใหม่ได้ในอนาคต\n\n"
    },
    {
        "title":"Python คือ",
        "subtitle":"language for coding create from 1991",
        "image_url":"https://cdn.pixabay.com/photo/2014/05/02/21/47/laptop-336369_960_720.jpg",
        "detail":"pthon คือ อุปกรณ์ทางอิเล็กทรอนิกส์ (electrinic device) ที่มนุษย์ใช้เป็นเครื่องมือช่วยในการจัดการกับข้อมูลที่อาจเป็นได้ ทั้งตัวเลข ตัวอักษร หรือสัญลักษณ์ที่ใช้แทนความหมายในสิ่งต่าง ๆ โดยคุณสมบัติที่สำคัญของคอมพิวเตอร์คือการที่สามารถกำหนดชุดคำสั่งล่วงหน้าหรือโปรแกรมได้ (programmable) นั่นคือคอมพิวเตอร์สามารถทำงานได้หลากหลายรูปแบบ ขึ้นอยู่กับชุดคำสั่งที่เลือกมาใช้งาน ทำให้สามารถนำคอมพิวเตอร์ไปประยุกต์ใช้งานได้อย่างกว้างขวาง เช่น ใช้ในการตรวจคลื่นความถี่ของหัวใจ การฝาก - ถอนเงินในธนาคาร การตรวจสอบสภาพเครื่องยนต์ เป็นต้น ข้อดีของคอมพิวเตอร์ คือ เครื่องคอมพิวเตอร์สามารถทำงานได้อย่างมีประสิทธภาพ มีความถูกต้อง และมีความรวดเร็ว\n\nอย่างไรก็ดี ไม่ว่าจะเป็นงานชนิดใดก็ตาม เครื่องคอมพิวเตอร์จะมีวงจรการทำงานพื้นฐาน 4 อย่าง (IPOS cycle) คือ\n\nรับข้อมูล (Input) เครื่องคอมพิวเตอร์จะทำการรับข้อมูลจากหน่วยรับข้อมูล (input unit) เช่น คีบอร์ด หรือ เมาส์\n\nประมวลผล (Processing) เครื่องคอมพิวเตอร์จะทำการประมวลผลกับข้อมูล เพื่อแปลงให้อยู่ในรูปอื่นตามที่ต้องการ\n\nแสดงผล (Output) เครื่องคอมพิวเตอร์จะให้ผลลัพธ์จากการประมวลผลออกมายังหน่วยแสดงผลลัพธ์ (output unit) เช่น เครื่องพิมพ์ หรือจอภาพ\n\nเก็บข้อมูล (Storage) เครื่องคอมพิวเตอร์จะทำการเก็บผลลัพธ์จากการประมวลผลไว้ในหน่วยเก็บข้อมูล เพื่อให้สามารถนำมาใช้ใหม่ได้ในอนาคต\n\n"
    }    
]


